# 第6章 数据载入、存储及文件格式

## 6.1 文本格式数据的读写

In [1]:
import numpy as np
import pandas as pd

In [2]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
df = pd.read_csv('examples/ex1.csv')

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [8]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
names = ['a', 'b', 'c', 'd', 'message']

In [10]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [12]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])

In [13]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [14]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [15]:
result = pd.read_table('examples/ex3.txt', sep='\s+')

In [16]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [17]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [18]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [20]:
result = pd.read_csv('examples/ex5.csv')

In [21]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [22]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [23]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [24]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [25]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [26]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### 6.1.1 分块读入文本文件

In [27]:
pd.options.display.max_rows = 10

In [28]:
result = pd.read_csv('examples/ex6.csv')

In [29]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [30]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [31]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [32]:
chunker

In [33]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

In [34]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### 6.1.2 将数据写入文本格式

In [35]:
data = pd.read_csv('examples/ex5.csv')

In [36]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [37]:
data.to_csv('examples/out.csv')

In [38]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [39]:
import sys

In [40]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [41]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [42]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [43]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [44]:
dates = pd.date_range('1/1/2000', periods=7)

In [45]:
ts = pd.Series(np.arange(7), index=dates)

In [46]:
ts.to_csv('examples/tseries.csv')

/Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [47]:
!cat examples/tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

### 6.1.3 使用分隔格式

In [48]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [49]:
import csv
f = open('examples/ex7.csv')
reader = csv.reader(f)

In [50]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [51]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [52]:
header, values = lines[0], lines[1:]

In [53]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [54]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

### 6.1.4 JSON数据

In [55]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
 {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [56]:
import json

In [57]:
result = json.loads(obj)

In [58]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [59]:
asjson = json.dumps(result)

In [60]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [61]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [62]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [63]:
data = pd.read_json('examples/example.json')

In [64]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [65]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [66]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### 6.1.5 XML和HTML：网络抓取

In [67]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [68]:
len(tables)

1

In [69]:
failures = tables[0]

In [70]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [71]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [72]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

#### 6.1.5.1 使用lxml.objectify解析XML

In [73]:
from lxml import objectify

In [74]:
path = 'datasets/mta_perf/Performance_MNR.xml'  # 原始代码的路径不对
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [75]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
              'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [76]:
perf = pd.DataFrame(data)

In [77]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95,96,95,95
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95,96.3,95,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95,96.8,95,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95,96.6,95,95.8

In [78]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [79]:
root

In [80]:
root.get('href')

'http://www.google.com'

In [81]:
root.text

'Google'

## 6.2 二进制格式

In [82]:
frame = pd.read_csv('examples/ex1.csv')

In [83]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [84]:
frame.to_pickle('examples/frame_pickle')

In [85]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### 6.2.1 使用HDF5格式

In [86]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [87]:
store = pd.HDFStore('mydata.h5')

In [88]:
store['obj1'] = frame

In [89]:
store['obj1_col'] = frame['a']

In [90]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [91]:
store['obj1']

           a
0  -1.832858
1   0.565108
2  -0.293540
3  -0.054967
4  -0.358128
..       ...
95 -1.840853
96  2.673217
97  0.036934
98 -0.425886
99 -0.121229

[100 rows x 1 columns]

In [92]:
store.put('obj2', frame, format='table')

In [93]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  1.213393
11 -0.907724
12  1.735598
13 -0.420091
14  0.288876
15  0.654779

In [94]:
store.close()

In [95]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [96]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -1.832858
1  0.565108
2 -0.293540
3 -0.054967
4 -0.358128

### 6.2.2 读取Microsoft Excel文件

In [97]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [98]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [99]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [100]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [101]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [102]:
frame.to_excel(writer, 'Sheet1')

In [103]:
writer.save()

In [104]:
frame.to_excel('examples/ex2.xlsx')

## 6.3 与Web API交互

In [105]:
import requests

In [106]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [107]:
resp = requests.get(url)

In [108]:
resp

In [109]:
data = resp.json()

In [110]:
data[0]['title']

'TST: add tzaware case to indices fixture'

In [111]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])

In [112]:
issues

,number,title,labels,state
0,31241,TST: add tzaware case to indices fixture,[],open
1,31240,Backport PR #31211 on branch 1.0.x (BUG: Fixed...,[],open
2,31239,COMPAT: tzawareness behavior to be same as dat...,[],open
3,31238,REGR: Fix GroupBy aggregation with ExtensionAr...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
4,31237,CI: Fix Assign CI not working with quotes,[],open
...,...,...,...,...
25,31204,convert numeric column to dedicated `pd.String...,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
26,31202,"IntervalIndex.map raises ""TypeError: Unexpecte...","[{'id': 150096370, 'node_id': 'MDU6TGFiZWwxNTA...",open
27,31200,raise more explanatory error when failing init...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
28,31199,Writing HDF5 with StringDtype columns fails wi...,[],open
29,31198,DOC Remove Python 2 specific comments from doc...,[],open

## 6.4 与数据库交互

In [113]:
import sqlite3

In [114]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL, d INTEGER
);"""

In [115]:
con = sqlite3.connect('mydata.sqlite')

In [116]:
con.execute(query)

In [117]:
con.commit()

In [118]:
data = [('Atlanta', 'Gerogia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacramento', 'California', 1.7, 5)]

In [119]:
stmt = 'INSERT INTO test VALUES(?, ?, ?, ?)'

In [120]:
con.executemany(stmt, data)

In [121]:
con.commit()

In [122]:
cursor = con.execute('select * from test')

In [123]:
rows = cursor.fetchall()

In [124]:
rows

[('Atlanta', 'Gerogia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [125]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [126]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Gerogia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [127]:
import sqlalchemy as sqla

In [128]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [129]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Gerogia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5